re3turn/dot
getopts
git_util
fishkit
jethrokuan/fzf
jorgebucaran/fishtape
jethrokuan/z
decors/fish-ghq
re3turn/theme-agnoster
await
edc/bass
last_job_id
ryotako/fish-global-abbreviation
get
d42/fish-pip-completion
