fishpkg/fish-await
fishpkg/fish-get
fishpkg/fish-git-util
fishpkg/fish-last-job-id
jorgebucaran/fish-getopts
jorgebucaran/fishtape
laughedelic/fishkit
jethrokuan/fzf
jethrokuan/z
decors/fish-ghq
re3turn/fish-dot
re3turn/theme-agnoster
edc/bass
ryotako/fish-global-abbreviation
d42/fish-pip-completion
