re3turn/theme-agnoster
fisherman/await
edc/bass
re3turn/fish-dot
fisherman/fishkit
fisherman/fishtape
fisherman/fzf
fisherman/get
fisherman/getopts
decors/fish-ghq
fisherman/git_util
ryotako/fish-global-abbreviation
fisherman/last_job_id
fisherman/menu
d42/fish-pip-completion
fisherman/z
