jorgebucaran/getopts.fish
jorgebucaran/fishtape
laughedelic/fishkit
jethrokuan/fzf
jethrokuan/z
decors/fish-ghq
re3turn/fish-dot
re3turn/fish-pip-completion
re3turn/fish-await
re3turn/fish-get
re3turn/fish-git-util
re3turn/fish-last-job-id
edc/bass
reitzig/sdkman-for-fish@v1.4.0
oh-my-fish/theme-bobthefish
mnowotnik/fzshell
