tap "d-kuro/tap"

# Shell
brew "bash"
brew "fish"
brew "sheldon"
brew "thefuck"

# Git
brew "git"
brew "git-delta"
brew "gh"
brew "tig"
brew "d-kuro/tap/gwq"

# GNU tools
brew "binutils"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "grep"
brew "gzip"
brew "moreutils"

# Editor
brew "neovim"

# Search & File
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "hexyl"
brew "ripgrep"
brew "tree"

# Languages & Package managers
brew "go"
brew "rust"
brew "python@3.14"
brew "pyenv"
brew "pnpm"

# Security
brew "grype"
brew "syft"
brew "trivy"

# CLI tools
brew "awscli"
brew "cask"
brew "colordiff"
brew "curl"
brew "jid"
brew "jq"
brew "less"
brew "nkf"
brew "pet"
brew "powershell"
brew "procs"
brew "source-highlight"
brew "sqlite"
brew "tfenv"
brew "wget"
brew "xxh"
brew "zellij"

# Casks
cask "claude"
cask "claude-code"
cask "cmux"
cask "copilot-cli"
cask "docker-desktop"
cask "firefox"
cask "gcloud-cli"
cask "ghostty"
cask "google-drive"
cask "jetbrains-toolbox"
cask "kap"
cask "meetingbar"
cask "microsoft-teams"
cask "notion"
cask "postman"
cask "raycast"
cask "session-manager-plugin"
cask "stillcolor"
cask "the-unarchiver"
cask "visual-studio-code"
cask "windows-app"
cask "wireshark-app"

# Go tools
go "github.com/Songmu/ghg/cmd/ghg"
go "github.com/x-motemen/ghq"
go "github.com/nao1215/gup"
go "github.com/toshimaru/nyan"
go "github.com/oklog/ulid/v2/cmd/ulid"
