tap "d-kuro/tap"

# GNU tools (macOS only - replaces BSD tools)
brew "binutils"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "grep"
brew "gzip"
brew "moreutils"

# Languages (managed outside Nix)
brew "go"
brew "rust"
brew "python@3.14"

# macOS specific
brew "cask"
brew "powershell"
brew "tfenv"
brew "d-kuro/tap/gwq"

# Casks
cask "claude"
cask "claude-code"
cask "cmux"
cask "copilot-cli"
cask "docker-desktop"
cask "firefox"
cask "gcloud-cli"
cask "ghostty"
cask "google-drive"
cask "jetbrains-toolbox"
cask "kap"
cask "meetingbar"
cask "microsoft-teams"
cask "notion"
cask "postman"
cask "raycast"
cask "session-manager-plugin"
cask "stillcolor"
cask "the-unarchiver"
cask "visual-studio-code"
cask "windows-app"
cask "wireshark-app"

# Go tools
go "github.com/nao1215/gup"
go "github.com/toshimaru/nyan"
go "github.com/oklog/ulid/v2/cmd/ulid"
